app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers"
---
  def index
    @answers = Answer.all

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @answer = Answer.find(params[:id])

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @answer = Answer.find(params[:id])

INSERT INTO "answers" ("Evaluating_field", "Query_No_1", "Query_No_10", "Query_No_2", "Query_No_3", "Query_No_4", "Query_No_5", "Query_No_6", "Query_No_7", "Query_No_8", "Query_No_9", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @answer = Answer.new(params[:answer])

    respond_to do |format|
      if @answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "2"]]
---
  def update
    @answer = Answer.find(params[:id])

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 1]]
---
  def destroy
    @answer = Answer.find(params[:id])
    @answer.destroy