app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password", "password_confirmation", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
 def create
@user = User.new(params[:user])
respond_to do |format|
if @user.save